Revit 2024 API
Control.Shape Property
 The control shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ControlShape Shape { get; }
Visual Basic
Public ReadOnly Property Shape As ControlShape
	Get
Visual C++
public:
property ControlShape Shape {
	ControlShape get ();
}
See Also
Control Class
Autodesk.Revit.DB Namespace